app/controllers/companies_controller.rb

  def index
    @company = Company.all
---
SELECT "companies".* FROM "companies"

  def create
    @company = Company.new(permitted_params[:company])

    if @company.save
---
INSERT INTO "companies" ("name", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Dummy's Dummies"], ["details", "Dummies, Dummy."], ["created_at", "2020-06-16 16:40:56.682047"], ["updated_at", "2020-06-16 16:40:56.682047"]]