app/controllers/companies_controller.rb

  def show
    @company = Company.find(permitted_params[:id])
    @company = Company.first
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @company = Company.new(permitted_params[:company])

    if @company.save
---
INSERT INTO "companies" ("name", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ngvhgv"], ["details", "hvhgchgc"], ["created_at", "2020-06-14 17:10:22.065022"], ["updated_at", "2020-06-14 17:10:22.065022"]]