app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_employee
    @employee = Employee.find(permitted_params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_company
    @company = Company.find(permitted_params[:company_id])