app/controllers/employees_controller.rb

INSERT INTO "employees" ("forename", "surname", "created_at", "updated_at", "company_id") VALUES (?, ?, ?, ?, ?)  [["forename", "Gomez"], ["surname", "Addams"], ["created_at", "2020-06-16 16:57:50.863354"], ["updated_at", "2020-06-16 16:57:50.863354"], ["company_id", 2]]
---
  def create
    @employee = @company.employees.build(permitted_params[:employee])
    if @employee.save

UPDATE "employees" SET "surname" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["surname", "Pugwash"], ["updated_at", "2020-06-16 16:33:31.378555"], ["id", 9]]
---
  def update
    if @employee.update(forename: permitted_params[:forename],
                        surname: permitted_params[:surname])

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def set_employee
    @employee = Employee.find(permitted_params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_company
    @company = Company.find(permitted_params[:company_id])